const data = {
    "name": "漫威电影宇宙",
    "img": "../src/792b1749f91c297ee579fc76b52c2552.jpeg",
    "size": "100",
    "other": "漫威电影宇宙（Marvel Cinematic Universe，简称MCU）是由漫威漫画和漫威工作室联合制作的一系列与漫威角色相关的超级英雄电影。MCU于2008年开始，从《钢铁侠》起步，并经过多个电影、电视剧和网剧的交叉编织，共同构建出一个庞大的、连贯的宇宙。在MCU中，观众见证了钢铁侠、美国队长、雷神索尔、黑寡妇、绿巨人、蜘蛛侠、复仇者联盟等众多超级英雄的诞生和发展，他们一起对抗邪恶势力，保护地球和宇宙的和平。MCU还引入了诸如灭霸、洛基、奇异博士、黑豹、瓦坎达、黑寡妇等丰富多样的角色和世界观念。通过跨界故事和角色的互动，MCU吸引了全球观众的热情，并成为了现代超级英雄电影的巅峰之作。",
    "children": [
        {
            "name": "复仇者联盟",
            "size": "80",
            "img": "../src/c53d9155c5f3465d61b830409b5bf30a.jpeg",
            "other": "是由漫威漫画公司创作的超级英雄系列故事。该系列包括由钢铁侠、雷神、绿巨人、美国队长、黑寡妇和鹰眼等超级英雄组成的团队，以及许多其他角色。他们联手对抗邪恶势力，拯救世界免受毁灭性的威胁。",
            "children": [
                {
                    "name": "初代",
                    "size": "60",
                    "img": "../src/3b81316890ca9c9ec61514e43b0402b6.jpg",
                    "other": "初代复仇者联盟是由钢铁侠、雷神索尔、美国队长、黑寡妇、黄蜂女和鹰眼组成的。他们在第一次漫威复仇者联盟系列中首次组建起来，联手对抗邪恶势力。每位成员都有自己独特的能力和背景，他们团结一致，共同对抗威胁地球的超级恶棍。初代复仇者联盟在漫威漫画中取得了巨大的成功，并逐渐发展成了一个庞大的英雄团队，新成员不断加入。复仇者联盟也成为漫威电影宇宙的核心，通过系列电影将超级英雄们的故事连接在一起。他们的团结和勇气激发了观众的热情，并成为超级英雄电影的经典之作。",
                    "children": [{
                        "name": "钢铁侠",
                        "size": "50",
                        "img": "../src/p5.jpg",
                        "other": "钢铁侠拥有能赋予他超人的力量和耐力、飞行能力和设有多种高科技武器的动力服，装甲是由托尼本人亲自设计并且大部分时间都是由他所穿戴的。托尼本身就是一位在美国十分著名的亿万富翁和军火制造商，以他独特的生活方式和其天才级智商和发明天赋而闻名。其他曾经成为钢铁侠的人包括多年来的伙伴与挚友詹姆斯·罗德斯斯（战争机器）"

                    },
                    {
                        "name": "绿巨人浩克",
                        "size": "50",
                        "img": "../src/44512bab9fcdb8a2e2c306ff31d7e0a3.jpg",
                        "other": "绿巨人浩克是漫威漫画中的角色之一，真实身份为科学家布鲁斯·班纳。当他遭受极度愤怒时，体内隐含的放射性能量会被激发，使他变成体型巨大、力量强大的绿色人形生物，被称为“浩克”。"
                    },
                    {
                        "name": "雷神",
                        "size": "50",
                        "img": "../src/569661b73103094c23cda8ef9286c8cd.jpg",
                        "other": "阿斯加德王国的王子。他拥有神力，能操控雷电和拥有超人的力量与耐力，战斗时通常手持神锤“mjolnir”。雷神忠诚勇敢，是强大而正直的战士，与复仇者联盟以及他的兄弟洛基共同对抗各种邪恶势力，保护地球和宇宙的安全。他的传说与北欧神话中的雷神索尔息息相关，被视为阿斯加德的守护者和正义的象征。"
                    },
                    {
                        "name": "美国队长",
                        "size": "50",
                        "img": "../src/4e1d3f1e260ab67fa4f008a098f6e80f.jpg",
                        "other": "史蒂夫·罗杰斯。他是二战期间的士兵，接受了“超级士兵计划”的改造，身体变得强壮且敏捷。他手持红白蓝圆盾，代表自由与正义，成为美国队长的象征。他是一位无畏、正直和忠诚的领导者，始终为了保护人类和捍卫正义而战斗。美国队长是复仇者联盟的核心成员之一，与其他超级英雄一起抵御各种威胁。他的形象体现了美国的价值观，成为了一个受人民尊敬和仰慕的超级英雄。"
                    },
                    {
                        "name": "黑寡妇",
                        "size": "30",
                        "img": "../src/t1.jpg",
                        "other": "她是一位出色的特工和间谍，擅长各种格斗技能和武器的运用。她曾经是苏联的间谍，后来加入了复仇者联盟，成为其中一员。黑寡妇机智聪慧，勇敢无畏，拥有出色的战术眼光和干练的行动能力。她在复仇者联盟中发挥着重要的角色，为保护世界和平而战斗。黑寡妇的过去充满谜团，她经历了许多挑战与复杂的情感纠葛，但她始终以坚定的意志和冷静的头脑面对，并展现出令人钦佩的勇气和毅力。"
                    },
                    {
                        "name": "鹰眼",
                        "size": "30",
                        "img": "../src/6f9f3c9b370693823c4315c835606270.jpg",
                        "other": "克林特·巴顿（Clint Barton）。他是一位顶尖的弓箭手和特工，曾经是“盾牌”组织的一员，后来加入了复仇者联盟，成为其中一员。鹰眼有着出色的射击技能和战术眼光，能够在极为短暂的时间内做出正确的判断并做出应对。同时，他还是一位身手敏捷、反应迅速的战斗高手。鹰眼机智幽默，性格开朗，但也隐藏着内心深处的痛苦和不安。他的仁慈和同情心让他成为复仇者中最受欢迎的角色之一。他在不断地挑战自我，力图成为更好的人和更优秀的英雄。"
                    }


                    ]
                },
                {
                    "name": "二代",
                    "size": "60",
                    "img": "../src/3b81316890ca9c9ec61514e43b0402b6.jpg",
                    "other": "在漫威电影宇宙中，二代复仇者联盟是由钢铁侠托尼·斯塔克创建的团队。在《复仇者联盟2奥创纪元》中，他为了应对新的威胁而创造了一个人工智能超级英雄“幻视”，并招募了战争机器、女巫和快银。他们与美国队长、黑寡妇和鹰眼这些初代复仇者联盟成员一起组成了二代复仇者联盟。二代复仇者联盟在《复仇者联盟3：无限战争》和《复仇者联盟4：终局之战》中发挥了重要作用。",
                    "children": [
                        {
                            "name": "蜘蛛侠",
                            "size": "50",
                            "img": "../src/f618eb25e560646cc8a428f38af7138c.jpg",
                            "other": "彼得·帕克（Peter Parker）。他原本是一个普通的高中生，但在被一只被辐射的蜘蛛咬伤后，他获得了超人类的蜘蛛能力。蜘蛛侠具有超强的力量、敏捷度和反应能力，同时具备粘附墙壁和蜘蛛感知的能力。他利用自己的超能力来保护纽约市的居民免受各种威胁，成为了一名超级英雄。蜘蛛侠的特色是他的智慧和创造力，他善于利用科技和战术来对抗敌人。他也面临着个人生活和英雄使命之间的挣扎，但他始终坚持着正义和责任感。"
                        },
                        {
                            "name": "蚁人",
                            "size": "50",
                            "img": "../src/161d111f82e526ba0d7874df54859d8a.png",
                            "other": "亨利·皮姆（Henry Pym），后由斯科特·朗格（Scott Lang）继承其蚁人身份。亨利·皮姆是一位天才科学家，发明了让人缩小并掌控蚂蚁的技术，并在战斗中使用这项技术。他还发明了可以让他变成巨人的“黄蜂人”技术。后来，斯科特·朗格成为了新的蚁人，他也具有把身体缩小和扩大的能力，并以此来打击罪犯。蚁人技能独特，不仅可以缩小或扩大身体，还可以与蚂蚁进行心灵感应，跑过墙壁等功夫。蚁人具有幽默感和乐观态度，是复仇者中最不一样的英雄之一。他在众多的战斗中表现出色，为保护世界和平而奋斗。"
                        },
                        {
                            "name": "猎鹰",
                            "size": "30",
                            "img": "../src/5c6aa35bd234efed65fbdbd5b2226fd4.jpg",
                            "other": "山姆·威尔逊（Sam Wilson）。他是美国空军的退伍士兵，经过一系列的特训和实验后，获得了一对由机械翅膀组成的高科技飞行装备。猎鹰具有飞行、敏捷和战斗技能，他的飞行装备还包括导弹和机枪等武器系统。猎鹰被邀请加入了复仇者联盟，并与美国队长等超级英雄并肩作战。他的翅膀和战术眼光使他成为一名出色的远程侦察和支援角色，为团队提供重要的情报和战斗支持。猎鹰是一个忠诚正直的英雄，他始终以保护人民的安全和正义为己任。"
                        },
                        {
                            "name": "旺达",
                            "size": "30",
                            "img": "../src/ee4bd6e474dfc00cbba33fa2565655a8.jpg",
                            "other": "绯红女巫。旺达是一位具有超能力的变种人，她拥有能够操纵现实和概率的能力。她可以发射能量束、操控物体和人的思维，并且可以创造幻境。旺达是复仇者联盟中的成员之一，她在战斗中展现了强大的力量和战斗技巧。她是一个复杂的角色，经历过许多困难和挫折，但她也展现出了勇气和坚强。旺达具有强大的情感和家庭观念，对她的孪生兄弟夸奇欧（Quicksilver）和她的丈夫幻视（Vision）有着深厚的情感。"
                        },
                        {
                            "name": "幻视",
                            "size": "30",
                            "img": "../src/d134ec38e10b8ce2938eb657c344bef2.jpg",
                            "other": "一位合成人类。幻视原本是由人类科学家亨利·皮姆（Henry Pym）和托尼·斯塔克（Tony Stark）共同创造的。他的身体由复杂的机械部件和矿物质构成，拥有超强的力量、耐久性和能力。幻视还具有相位能力，可以通过改变自己的分子结构穿越固体物体。他具备出色的智力和战斗技巧，是一名出色的战略家和领导者。幻视在漫威宇宙中扮演了关键的角色，成为了复仇者联盟的成员之一，并与其他英雄一起保护地球免受威胁。他在故事中经历了很多变化和挑战，但始终保持着对正义和道义的坚守。"
                        },
                        {
                            "name": "黑豹",
                            "size": "30",
                            "img": "../src/be1dbbd99e7a084bdc4d852bd338d453.jpg",
                            "other": "全名泰查拉（T’Challa）。他来自非洲国家瓦坎达，是该国的国王和超级英雄。黑豹拥有一套由瓦坎达特殊矿石制成的黑豹装甲，赋予他超人的力量、敏捷和耐力。他还拥有独特的瓦坎达传统技艺，包括猎豹形态和精湛的格斗技巧。黑豹是智慧、勇气和正义的象征，他以保护瓦坎达人民为使命，同时也在全球范围内扮演着积极正面的角色。在漫画和电影中，黑豹以其卓越的领导能力和战斗才华赢得了观众的喜爱。他是一个强大而充满魅力的角色，代表着非洲文化的力量和传统。"
                        }
                    ]
                }

            ]

        }
        , {
            "name": "银河护卫队",
            "img": "../src/8356659388d821e119025d593085d77f.jpeg",
            "size": "60",
            "other": "漫威漫画及其电影宇宙中的一个超级英雄团队。与其他漫威英雄不同，银河护卫队的成员来自宇宙各个角落，包括外星人、改造人和树人等。原本是一群各怀鬼胎的罪犯，他们被迫组成团队共同对抗宇宙级威胁。在电影中，银河护卫队的核心成员包括外表绿色的盖莱斯（Gamora）、机智幽默的星爵（Star-Lord）、坚实忠诚的咔玛利恩（Drax the Destroyer）、懒散可爱的火箭（Rocket Raccoon）以及善良的格鲁特（Groot）。他们在银河系中经历了一系列冒险，揭露了宇宙中隐藏的威胁，同时也发展了深厚的友谊。银河护卫队的电影系列以其独特的幽默风格、精彩的动作戏和独特的角色组合而受到了广大观众的喜爱，并成功地将这个不太为人们熟知的超级英雄团队带入了主流影视文化。",
            "children": [
                {
                    "name": "传奇星爵",
                    "size": "40",
                    "img": "../src/14c11ee0464f37a3aebb2a195a9be4b7.jpeg",
                    "other": "全名彼得·杰森·奎尔（Peter Jason Quill）。他是一个宇宙海盗和一名外星人混血儿，由克里人和地球人的血统组成。星爵是守卫者（Guardians）小队的领导者，他带领着一群五花八门的异种英雄保护宇宙的安全。他擅长使用各种武器，包括能发射能量的武器和空间飞船。星爵经常展现出幽默的个性和不拘一格的行为风格，但在需要时他也展现了过人的勇气和决心。他在故事中经历了许多冒险和成长，并与队友们建立了深厚的友谊。"
                },
                {
                    "name": "树人格鲁特",
                    "size": "40",
                    "img": "../src/284d61e986b2ef167aea23531e9ecb4c.jpeg",
                    "other": "一棵来自行星X的外星生物。格鲁特的身体由木质组织构成，外貌类似一棵高大的树木。尽管他只能说出一句话“我是格鲁特”（I am Groot），但他的意思会因着口吻和语气的变化而有所不同。格鲁特是守卫者小队的成员之一，他具备强大的力量和快速的再生能力，可以通过延伸身体和分离身体的碎片进行攻击和防御。虽然格鲁特看起来像是一个沉默寡言的生物，但他在关键时刻展现出了对队友的忠诚和无私的精神。格鲁特的形象和个性让他成为守卫者小队中一位备受喜爱的角色"
                },
                {
                    "name": "毁灭者德拉斯特",
                    "size": "30",
                    "img": "../src/7286efc3e24d7cedbc33856c8758fd54.jpeg",
                    "other": "曾经是一位在宇宙中闻名的战士和杀手。他拥有膜拜星球上的超人类能力和高智商，以及许多高科技武器和设备。在过去的故事中，德拉斯特曾是星际英雄罗马的队友，并同样是其他许多超级英雄的对手。不过，最近在漫威宇宙的重置中，德拉斯特成为了新的守护者（Guardians）小队中的一员。他的新角色概念是一个以盗贼和流浪者为主的反英雄类型，不仅在外表上和过去的版本有所不同，也在为人处事和行动风格上有所变化。不管是哪个版本的德拉斯特，他都是一个强大的敌人或盟友，具有不可忽视的存在感。"
                },
                {
                    "name": "火箭浣熊",
                    "size": "30",
                    "img": "../src/4c641924435736c4654adc75f4ff4981.jpeg",
                    "other": "一只来自行星X的智能浣熊。火箭浣熊是守卫者（Guardians）小队中的成员之一，同时也是宇宙中的职业盗贼和枪手。他擅长使用各种武器，尤其是火箭筒，因此得名火箭浣熊。尽管他是一只动物，但火箭浣熊拥有人类般的智慧和语言能力，他具备战术洞察力和过人的射击技巧。虽然火箭浣熊表现出了叛逆和刁钻的个性，但在需要时他也展现出了对队友的忠诚和勇敢。他和格鲁特之间形成了一种特殊的友谊和默契，成为了守卫者小队中不可或缺的一员。"
                },
                {
                    "name": "卡魔拉",
                    "size": "30",
                    "img": "../src/a45f4de0539d9d45e0ab4cbbd19d63f7.jpeg",
                    "other": "一只来自行星X的智能浣熊。火箭浣熊是守卫者（Guardians）小队中的成员之一，同时也是宇宙中的职业盗贼和枪手。他擅长使用各种武器，尤其是火箭筒，因此得名火箭浣熊。尽管他是一只动物，但火箭浣熊拥有人类般的智慧和语言能力，他具备战术洞察力和过人的射击技巧。虽然火箭浣熊表现出了叛逆和刁钻的个性，但在需要时他也展现出了对队友的忠诚和勇敢。他和格鲁特之间形成了一种特殊的友谊和默契，成为了守卫者小队中不可或缺的一员。"
                },
                {
                    "name": "星云",
                    "size": "30",
                    "img": "../src/54bb0f67f91436156db8d923d6194667.jpeg",
                    "other": "守护者（Guardians）小队中的成员之一。星云最初是一个恶势力的手下，也是“无限之手”的成员，她在与卡魔拉的战斗中曾成为对手。然而，随着时间的推移，星云逐渐改变立场，加入了守护者小队，成为了他们的盟友。星云是一个充满机械改造的人造人，她的身体被不断改进以增加力量和耐力。尽管外表严肃冷酷，星云在她的行动中逐渐展现出无私和勇气。她对于复仇的渴望推动着她，但随着与守护者的交流和团队合作，她也逐渐发现自己内心的深层情感和意义。星云的角色在故事中经历了许多转变和成长，她成为了一个令人称赞的反英雄角色。"
                },
                {
                    "name": "螳螂女",
                    "size": "30",
                    "img": "../src/b735ea12efd3b59aed15e01035863175.jpeg",
                    "other": "守护者（Guardians）小队中的成员之一。螳螂女是一位来自行星Energia的异能生物，她具备特殊的心灵感应能力。她可以读取他人的情感和思想，并利用这些能力进行心灵疗愈和操控他人的情绪。螳螂女在小队中担任着心灵作用，能够帮助队友平衡情绪和解决内心的冲突。虽然她的外貌看起来娇小且天真，但螳螂女的能力和智慧却令人惊叹。她是一个善良、乐观且富有同情心的角色，经常以幽默和温暖的方式与守护者小队的成员交流。螳螂女在故事中展现了她与众不同的能力和独特的个性，成为了守护者小队中不可或缺的一员。"
                }

            ]
        },
        {
            "name": "阿斯加德神国",
            "size": "60",
            "img": "../src/a874bee6c8f7f35e57d2c54cd9f83b32.jpeg",
            "other": "漫威漫画及其电影宇宙中的一个虚构世界，是雷神索尔和诸神的故乡。在这个神秘的九界之一中，诸神王奥丁（Odin）坐镇，并有三位狄俄尼索斯女神守卫他的王座。阿斯加德是一个宏大壮观的地方，其地形由由一座座山峦和城墙组成，同时也有着宏伟的宫殿和堡垒。阿斯加德成员包括众多神祇和超越常人的生灵，如雷神索尔、奥丁、托尔、洛基等。漫威电影宇宙的《雷神》系列电影和《复仇者联盟》电影中，阿斯加德成为了故事重要的背景之一，也让观众感受到了神话世界的独特魅力。同时，阿斯加德的文化和价值观也被赋予了现代的精神内涵，成为了人们探索身份认同、责任和英雄主义等主题的重要元素之一。",
            "children": [
                {
                    "name": "神王奥丁",
                    "size": "30",
                    "img": "../src/726497fe3d785904688ff63aae57f38c.jpeg",
                    "other": "阿斯加德（Asgard）的统治者和诸神之父。奥丁被描绘为一位强大的战士和谋略家，拥有无与伦比的力量和智慧。他是一位严厉而公正的领袖，总是为了守护阿斯加德和整个宇宙而奋斗。奥丁是一位深思熟虑的角色，他重视荣耀、忠诚和传统。然而，在他的角色发展过程中，奥丁也逐渐被揭示出了他内心的矛盾和错误。他不时采取极端的手段解决问题，甚至牺牲自己的儿子洛基，以换取对抗自己的敌人的取胜。奥丁的角色复杂而不断发展，他的形象变得更加丰富有趣。他是漫威宇宙中一个具有深远影响力的角色，影响了诸如雷神索尔等后续的角色发展。"
                },
                {
                    "name": "洛基",
                    "size": "50",
                    "img": "../src/43d07e6b620ab550072e967584b17cfb.jpeg",
                    "other": "阿斯加德（Asgard）的一员，也是阿斯神之王奥丁的养子。洛基是一个复杂的角色，他的身份和动机经常游离于善恶之间。他狡猾、策略性强，擅长操控和欺骗他人，常常以自己的目的为导向。洛基具有强大的魔法能力，可以变身和产生幻象。尽管表面上似乎是个冷酷的反派，但在其中可以看出他内心深处的不安和渴望被认同。随着剧情的发展，洛基的角色逐渐展现出他勇敢和无私的一面，他为了拯救人类和宇宙，与他的兄弟雷神索尔合作。洛基是一个备受争议和受关注的角色，他的复杂性和嬉皮笑脸的性格使他成为了漫威宇宙中最受欢迎和深受喜爱的角色之一。"
                },
                {
                    "name": "索尔",
                    "size": "50",
                    "img": "../src/569661b73103094c23cda8ef9286c8cd.jpg",
                    "other": "阿斯加德王国的王子。他拥有神力，能操控雷电和拥有超人的力量与耐力，战斗时通常手持神锤“mjolnir”。雷神忠诚勇敢，是强大而正直的战士，与复仇者联盟以及他的兄弟洛基共同对抗各种邪恶势力，保护地球和宇宙的安全。他的传说与北欧神话中的雷神索尔息息相关，被视为阿斯加德的守护者和正义的象征。"
                },
                {
                    "name": "海姆达尔",
                    "size": "30",
                    "img": "../src/0cd83ef3f1833128461c9524b0298b96.jpg",
                    "other": "北欧神话中的阿斯神之一，是守卫奥丁彩虹桥的守卫者。他被描绘为一位神勇且冷静的战士，拥有惊人的视力和感知力，能够在极远的距离内感知到任何危险和入侵者的行踪。作为阿斯神之一，他是阿斯加德安全的最后一道防线。海姆达尔被描绘为非常忠诚于奥丁和阿斯加德，并愿意为了保护他们而献身。尽管他被认为是一个寡言的角色，但他非常坚定和勇敢，并在重要关头表现出极度的胆魄和果敢。"

                },
                {
                    "name": "女武神",
                    "size": "30",
                    "img": "../src/58d0857d6446c05a6fc1c29b9c16bfb3.jpg",
                    "other": "北欧神话中的女战士，也是漫威漫画和电影中的一个角色。她通常被描绘为战斗力强大的女性，拥有勇敢和决断的性格。女武神们被神明派遣成为战场上英勇战士的灵魂收割者，将英勇战士的灵魂引领到瓦尔哈拉。在漫威电影《雷神：黑暗世界》和《雷神：诸神黄昏》中，女武神泰莎·汤普森饰演的角色瓦基里成为了女武神的代表。瓦基里是阿斯加德的女战士，善于战斗，并具有非凡的剑术技巧。她坚韧、自信，善于捍卫自己和她所认为正确的事情。女武神形象展示了女性在战斗中的坚韧和勇气，她们成为了强大力量和自主性的象征。"
                }
            ]
        },
        {
            "name": "地球超级英雄",
            "size": "80",
            "img": "../src/9bf3a6322be3a571556f69bb267af5aa.jpeg",
            "other": "地球上的超级英雄",
            "children": [
                {
                    "name": "至尊圣所",
                    "size": "60",
                    "img": "../src/cd1f8e51d194847b02881ccb686737df.jpg",
                    "other": "一个神秘而神奇的地方，被称为卡玛塔让（Kamar-Taj）。位于尼泊尔的至尊会所是奇异博士学习和探索魔法及神秘力量的圣地。会所本身古老而宏伟，环境优美，被壮丽的喜马拉雅山脉所环抱。会所拥有丰富的图书馆和学术资源，收藏了关于魔法和神秘力量的珍贵文献。学员们在至尊会所接受严格的训练和指导，学习掌握各种神秘技巧和超凡能力，并通过学院的试炼来锤炼自己。至尊会所是一个独特的学习和修行场所，让学员们发掘内心的力量，以保护世界免受邪恶势力的侵袭.",
                    "children": [
                        {
                            "name": "奇异博士",
                            "size": "50",
                            "img": "../src/c8123f21b8f8afd5eb7d026e08ff1970.jpg",
                            "other": "本名斯蒂芬·斯特兰奇（Stephen Strange）。他起初是一位顶尖的神经外科医生，因一次车祸导致双手无法再进行手术，最终找到了位于尼泊尔的神秘地方——康提沙贤岛，学习了魔法和神秘力量。奇异博士成为了一位魔法师和维护宇宙秩序的护卫者。他掌握了时间和空间的操控能力，可以通过符咒和法术与其他维度交互。奇异博士的形象深受观众喜爱，他不仅在战斗中展现出了强大的魔法技能，而且在反派压力和个人成长方面也面临了许多挑战。他是漫威宇宙中一个充满智慧和超凡力量的角色，为了保护地球和宇宙的和平而与邪恶势力斗争。"
                        },
                        {
                            "name": "王",
                            "size": "30",
                            "img": "../src/42a37f50aea81397e4d2b13f4358c16d.png",
                            "other": "奇异博士的好友和忠实助手，也是康提沙仙岛的守卫者之一。王是一名武术高手，掌握了多种武术技能和法术，并随时准备保护奇异博士和康提沙仙岛。王还是一个博学多才的学者，通晓多种语言和书法，并常以此为奇异博士解惑。作为奇异博士的好友，王随时待命并支持他的朋友，甚至在战斗中冒险，总是为奇异博士提供帮助。"
                        },
                        {
                            "name": "古一",
                            "size": "30",
                            "img": "../src/b69b54fdd3eb8f2023abbfdb9601e11c.jpeg",
                            "other": "奇异博士的导师和灵感来源。他是一位来自东方的幻术大师和神秘学家，能够操纵时间和空间，将自己的意识投射到其他世界中。古一被描绘为一位智慧和力量并存的老者，他拥有卓越的灵感和执行力，往往能够超越时间线预见未来，并提供关键帮助。在漫威电影《奇异博士》中，蒂尔达·斯文顿出演了这一角色，她将古一解释为一位百岁老人，同时也展现了古一的智慧和能力，在奇异博士的成长和对抗反派力量的过程中，提供了至关重要的指导和帮助。古一在漫威宇宙中是一个充满魅力和智慧的角色，被观众所喜爱。"
                        }
                    ]
                }, {
                    "name": "瓦坎达",
                    "size": "30",
                    "img": "../src/bf77b904b54b268170750e688f3c6b80.jpeg",
                    "other": "漫威漫画及其电影宇宙中的虚构国家，位于非洲内陆，被周围山脉环绕。它是一个先进科技的国家，拥有由奇瓦拉族（Wakandans）统治的封闭社会。瓦坎达的主要资源是振金（Vibranium），一种超级金属，被广泛应用于科技和武器中。瓦坎达保护自己的技术和资源，常常被外界看作是一个贫穷的国家。实际上，瓦坎达非常先进，并拥有高度发展的科技和文化。国王布拉克·泰’查拉（Black Panther）是瓦坎达的统治者，同时也是黑豹战士，拥有超凡的体能和技巧。瓦坎达在漫威电影宇宙中首次亮相是在《复仇者联盟2奥创纪元》，并在《黑豹》等电影中得到更加详细的描绘。瓦坎达的文化和传统深受奇瓦拉族的影响，尊重女性权益和部落价值观。这个国家展现了非洲文化的魅力，并给人们带来了与众不同的视角和故事。",
                    "children": [{
                        "name": "黑豹",
                        "size": "30",
                        "img": "../src/be1dbbd99e7a084bdc4d852bd338d453.jpg",
                        "other": "瓦坎达国的超级英雄。黑豹的真名是特查拉，他继承了瓦坎达国的王位和黑豹的力量，成为瓦坎达的守护者。黑豹具有超人的力量、速度和敏捷性，并戴着由瓦坎达特殊金属“振金”打造的超能服装，使他更加强大。特查拉作为国王，不仅拥有超凡的战斗技能，还有智慧和领导能力。黑豹以保护瓦坎达和正义为己任，同时也在漫威宇宙中与其他超级英雄合作，共同对抗邪恶势力。"
                    }]
                },
                {
                    "name": "神盾局",
                    "size": "30",
                    "img": "../src/5d240375ab38ce6f56a44034107ccfed.jpeg",
                    "other": "漫威漫画和电影宇宙中的一个特殊组织。神盾局是美国政府机构，旨在保护世界免受各种超自然、科技和外星威胁的侵袭。该组织主要负责情报收集、犯罪调查和特殊任务执行。神盾局的特工们都经过严格的训练，掌握了先进的战斗技能和科技装备。他们利用高科技设备和特殊能力与各种威胁作斗争，且经常与漫威超级英雄合作。神盾局是一个秘密组织，其行动常常隐秘而且需要保密。他们的任务是为了维护全球的安全和秩序，确保人类生活在一个安全的环境中。", "children": [{
                        "name": "黑寡妇",
                        "size": "30",
                        "img": "../src/t1.jpg",
                        "other": "她是一位出色的特工和间谍，擅长各种格斗技能和武器的运用。她曾经是苏联的间谍，后来加入了复仇者联盟，成为其中一员。黑寡妇机智聪慧，勇敢无畏，拥有出色的战术眼光和干练的行动能力。她在复仇者联盟中发挥着重要的角色，为保护世界和平而战斗。黑寡妇的过去充满谜团，她经历了许多挑战与复杂的情感纠葛，但她始终以坚定的意志和冷静的头脑面对，并展现出令人钦佩的勇气和毅力。"
                    }, {
                        "name": "尼克福瑞",
                        "size": "30",
                        "img": "../src/05e91c77aa899aef2516e797a5cf33ec.jpg",
                        "other": "组织“神盾局”（S.H.I.E.L.D.）的创始人和前局长。福瑞是一位无与伦比的战略家和间谍高手，具有非凡的领导才能和决断力。他在保护地球免受超级威胁方面起着关键作用，同时也是将不同超级英雄组织起来的关键人物。福瑞经常在漫威电影宇宙中与众多英雄互动，如《复仇者联盟》系列以及其他漫威电影作品中。他以他标志性的眼罩和锐利的洞察力闻名，常被人们称为“大佬”或“掌控者”。"
                    }]
                }
            ]
        }


    ]
}

drag = simulation => {

    function dragstarted(event, d) {
        if (!event.active) simulation.alphaTarget(0.3).restart();
        d.fx = d.x;
        d.fy = d.y;
    }

    function dragged(event, d) {
        d.fx = event.x;
        d.fy = event.y;
    }

    function dragended(event, d) {
        if (!event.active) simulation.alphaTarget(0);
        d.fx = null;
        d.fy = null;
    }

    return d3.drag()
        .on("start", dragstarted)
        .on("drag", dragged)
        .on("end", dragended);
}




// Specify the chart’s dimensions.
const width = 1400;
const height = 1300;


// Compute the graph and start the force simulation.
const root = d3.hierarchy(data);
const links = root.links();
const nodes = root.descendants();

const simulation = d3.forceSimulation(nodes)
    .force("link", d3.forceLink(links).id(d => d.id).distance(0).strength(1))
    .force("charge", d3.forceManyBody().strength(-3500))
    .force("x", d3.forceX())
    .force("y", d3.forceY());

// Create the container SVG.
const svg = d3.select("#chart").append("svg")
    .attr("width", width)
    .attr("height", height)

    .attr("viewBox", [-width / 2, -height / 2, width, height])
    .attr("style", "max-width: 100%; height: auto;");


// Append links.
const link = svg.append("g")
    .attr("stroke", "#999")
    .attr("stroke-opacity", 10)
    .selectAll("line")
    .data(links)
    .join("line");

// Append nodes.
const g = svg.append("g")
    .selectAll(".defs")
    .data(nodes)
    .join("defs")
    .append("pattern")
    .attr("id", (d, i) => "img" + i)
    .attr("height", "100%")
    .attr("width", "100%")
    .attr("patternContentUnits", "objectBoundingBox")
    .append("image")
    .attr("width", 1)
    .attr("height", 1)
    .attr("preserveAspectRatio", "none")
    .attr("xlink:href", function (d) { return d.data.img });

const node = svg.append("g")
    // .attr("fill", "#c82d31")
    .attr("stroke", "#c82d31")
    .attr("stroke-width", 3.5)
    .selectAll("circle")
    .data(nodes)
    .join("circle")
    .attr("fill", (d, i) => "url(#img" + i + ")")
    .attr("stroke", d => d.children ? null : "#c82d31")

    .attr("r", function (d) { return d.data.size })
    .call(drag(simulation));

const circles = svg.selectAll("circle")





node.append("title")
    .text(d => d.data.name)






const tooltip = d3.select("body").append("div")
    .attr("class", "tooltip")
    .style("opacity", 0);

node.on("mouseover", function (event, d) {
    tooltip.transition()
        .duration(200)
        .style("opacity", .9);
    tooltip.html(`<img src=${d.data.img} class="tooltip"><br>name: ${d.data.name}<br>介绍: ${d.data.other}`)

        .style("left", (event.pageX + 5) + "px")
        .style("top", (event.pageY - 28) + "px");
})
    .on("mouseout", function () {
        tooltip.transition()
            .duration(500)
            .style("opacity", 0);
    });





simulation.on("tick", () => {
    link
        .attr("x1", d => d.source.x)
        .attr("y1", d => d.source.y)
        .attr("x2", d => d.target.x)
        .attr("y2", d => d.target.y);

    node
        .attr("cx", d => d.x)
        .attr("cy", d => d.y);
});

//invalidation.then(() => simulation.stop());